---
kind: property
id: P:Autodesk.Revit.ApplicationServices.Application.ShowGraphicalWarningDuctDisconnects
source: html/e93cff90-6c46-f284-e11a-d852665b8178.htm
---
# Autodesk.Revit.ApplicationServices.Application.ShowGraphicalWarningDuctDisconnects Property

Whether or not to show the graphical warnings for duct disconnects.

## Syntax (C#)
```csharp
public bool ShowGraphicalWarningDuctDisconnects { get; set; }
```